# Mac App Store command-line interface (https://github.com/mas-cli/mas)
brew "mas"
# Install ZShell (https://sourabhbajaj.com/mac-setup/iTerm/zsh.html)
brew "zsh"
# Get lightweight comand line json processor
brew "jq"
# ccat is the colorizing cat (https://github.com/owenthereal/ccat)
brew "ccat"
# nvm to control node used node version
brew "nvm"
# install mongoldb
brew "mongodb/brew/mongodb-community"
# install postgresql
brew "postgresql@18"
# install switchaudio-osx to switch audio output from command line
brew "switchaudio-osx"
# install pyenv to manage python versions
brew "pyenv"
# install direnv to manage environment variables
brew "direnv"
# install stripe cli
brew "stripe/stripe-cli/stripe"
# instal watchman to avoid ulimit on watched files
brew "watchman"
# install go language binary
brew "go"
# install jsonnet to work with jsons
brew "jsonnet"
# install mitmproxy for reverse engineering
brew "mitmproxy"
# install pipx for reverse engineering executing binaries from Python packages in isolated environments
brew "pipx"
# install tailscale for acessing my personal servers
brew "tailscale"
# install docker-compose plugin (needed alongside cask "docker")
brew "docker-compose"
# install docker-buildx plugin (needed for docker compose build)
brew "docker-buildx"
# install fzf for interactive fuzzy selection in scripts
brew "fzf"
# install opencode AI coding agent
brew "anomalyco/tap/opencode"
